Console.Clear();

// Задача 15: Напишите программу, которая принимает на вход цифру,
// обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет

System.Console.WriteLine("Введите цифру, обозначающую день недели, и программа проверит, является ли этот день выходным");
int Day = Convert.ToInt32( Console.ReadLine() );

if (Day <1 || Day >7) //  знак  ||  = или
{
    System.Console.WriteLine("Введите цифру, обозначающую день недели от 1 до 7");
}
else
{
if (Day <6)
    System.Console.WriteLine("Придется поработать");
else
    System.Console.WriteLine("Ура! Выходной!");
}